Autodesk.Revit.DB.RevitLinkOptions.SetWorksetConfiguration(Autodesk.Revit.DB.WorksetConfiguration)
Sets the set of worksets to open when creating the link.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.RevitLinkOptions.GetWorksetConfiguration
Gets the set of worksets to open when creating the link.
Since:
2014

Autodesk.Revit.DB.RevitLinkOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.RevitLinkOptions.IsRelative
The type of path to use when creating the link. If true, Revit will
store a relative path for the link. If false, Revit will store an absolute
path.
If the link is to a Revit Server location, isRelative must be false.
Since:
2013

Autodesk.Revit.DB.RevitLinkOptions.#ctor(System.Boolean)
Creates a RevitLinkOptions object, specifying relative or absolute path type.
If the link is workshared, all worksets will be opened.
relative:
True if the link should use a relative path. False if it should use an
absolute path.
Since:
2013

Autodesk.Revit.DB.RevitLinkOptions.#ctor(System.Boolean,Autodesk.Revit.DB.WorksetConfiguration)
Creates a RevitLinkOptions object, specifying relative or absolute path type,
and the desired workset configuration.
relative:
True if the link should use a relative path. False if it should use an
absolute path.
config:
A WorksetConfiguration object specifying the worksets to open when creating
the link.
Leave as null if the file is not workshared.
Optionally, this may also be null for a workshared
file, in which case Revit will open all worksets.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.RevitLinkOptions.#ctor(Autodesk.Revit.DB.RevitLinkOptions)
Constructs a new copy of the input RevitLinkOptions object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.RevitLinkOptions
This class contains the options in use when creating
or loading a Revit link.
Since:
2013